//
//  SegmentioViewController.swift
//  Cario
//
//  Created by Sinakhanjani on 7/21/1397 AP.
//  Copyright © 1397 iPersianDeveloper. All rights reserved.
//

import UIKit
import SideMenu
import Segmentio

class SegmentioViewController: UIViewController {
    
    @IBOutlet fileprivate weak var segmentioView: Segmentio!
    @IBOutlet fileprivate weak var segmentViewHeightConstraint: NSLayoutConstraint!
    @IBOutlet fileprivate weak var scrollView: UIScrollView!
    @IBOutlet fileprivate weak var containerView: UIView!
    
    
    var segmentioStyle = SegmentioStyle.onlyLabel
    var selectedSegmentioIndex = 0

    override func viewDidLoad() {
        super.viewDidLoad()
        self.configureSideBar()
        updateUI()
        configureSegmentio()
        configureScrollView()
    }
    
    override func viewDidAppear(_ animated: Bool) {
        // SegmentioBuilder.setupBadgeCountForIndex(segmentioView, index: 1)
        segmentioView.valueDidChange = { segmentio, segmentIndex in
            // Scroll view change segment :
            let scrollViewWidth = self.scrollView.frame.width
            let contentOffsetX = scrollViewWidth * CGFloat(segmentIndex)
            self.scrollView.setContentOffset(CGPoint(x: contentOffsetX, y: 0), animated: true)
        }
    }
    
    // Actions
    @IBAction func backButtonPressed(_ sender: UIBarButtonItem) {
        self.dismiss(animated: true, completion: nil)
    }
    
    // Method
    func updateUI() {
        SegmentioBuilder.buildSegmentioView(
            segmentioView: segmentioView,
            segmentioStyle: segmentioStyle
        )
        segmentioView.selectedSegmentioIndex = selectedSegmentioIndex
        let scrollViewWidth = UIScreen.main.bounds.width
        let contentOffsetX = scrollViewWidth * CGFloat(selectedSegmentioIndex)
        self.scrollView.setContentOffset(CGPoint(x: contentOffsetX, y: 0), animated: true)
    }
    
    func configureSegmentio() {
        switch segmentioStyle {
        case .onlyLabel, .imageBeforeLabel, .imageAfterLabel:
            segmentViewHeightConstraint.constant = 50
        case .onlyImage:
            segmentViewHeightConstraint.constant = 100
        default:
            break
        }
    }
    
    // Content ViewControllers
    fileprivate func preparedViewControllers() -> [ContentViewController] {
        let pmController = ContentViewController.create()
        pmController.disaster = Disaster(
            cardName: .pm, title: "مرکز پیام", description: "توضیحات در این قسمت نوشته خواهد شد !", data: [
                (title: "موضوع در این قسمت نوشته میشود", description: "توضحیات موضوع به طور کامل در این قسمت ها نوشته خواهود شد"),
                (title: "موضوع در این قسمت نوشته میشود", description: "توضحیات موضوع به طور کامل در این قسمت ها نوشته خواهود شد"),
                (title: "موضوع در این قسمت نوشته میشود", description: "توضحیات موضوع به طور کامل در این قسمت ها نوشته خواهود شد")
            ]
        )
        
        let aboutController = ContentViewController.create()
        aboutController.disaster = Disaster(
            cardName: .aboutUs, title: "درباره ما", description: "درباره کاریـو", data: [
                (title: "«کاریو» یک پلتفرم جامع خدمات خودرو است که خدمات گوناگونی را ارائه می دهد", description: "با توجه به نوع خودروی شما، اطلاعاتی مفید و کاربردی در اختیار شما قرار می دهد" + "\n" + "سرویس های دوره ای و خدمات مورد نیاز شما را در محل با ضمانت کیفیت و قیمت انجام می دهد" + "شما می توانید از خدماتی نظیر دریافت خلافی، برآورد قیمت خودرو و درخواست امداد خودرو به راحتی استفاده کنید" + "\n" + "محل های ارائه دهنده ی خدماتی که امکان انجام آن ها در محل وجود ندارند در قالب یک مکان یاب مشخص شده اند. همچنین در این مکان یاب می توانید سایر مکان های مرتبط با خودرو مثل پارکینگ ها و پمپ بنزین ها مشاهده کنید" + "\n" + "با استفاده از «کاریو» به راحتی، بدون دردسر و با صرفه جویی در زمان و هزینه،  به بهترین شکل ممکن از خودروی خود نگهداری کنید")
            ]
        )
        
        let callUsController = ContentViewController.create()
        callUsController.disaster = Disaster(
            cardName: .callUs, title: "ارتباط با ما", description: "پل ارتباطی بین ما و شما، برای ارسال نظرات، پیشنهادات و انتقادات", data: [
                (title: String, description: String)
            ]()
        )
        
        let questionController = ContentViewController.create()
        questionController.disaster = Disaster(
            cardName: .question, title: "سوالات رایج", description: "سوالات متداول شمـا", data: [
                (title: "«کاریو» چیست؟", description: "«کاریو» یک پلتفرم جامع خدمات خودرو است که به چند صورت به شما کمک می کند" + "\n" + "با توجه به نوع خودروی شما، اطلاعاتی مفید و کاربردی در اختیار شما قرار می دهد." + "\n" + "سرویس های دوره ای و خدمات مورد نیاز شما را در محل با ضمانت کیفیت و قیمت انجام می دهد. " + "\n" + "شما می توانید از خدماتی نظیر دریافت خلافی، برآورد قیمت خودرو و درخواست امداد خودرو به راحتی استفاده کنید. " + "\n" + "محل های ارائه دهنده ی خدماتی که امکان انجام آن ها در محل وجود ندارند در قالب یک مکان یاب مشخص شده اند. همچنین در این مکان یاب می توانید سایر مکان های مرتبط با خودرو مثل پارکینگ ها و پمپ بنزین ها مشاهده کنید."),
                (title: "چه تضمینی برای انجام خدمات با کیفیت و رضایت من وجود دارد؟", description: "«کاریو» تنها با سرویس دهندگان معتبر و واجد شرایط و معیار های خود کار می کند و ضمانت بهترین قیمت و کیفیت را به شما می دهد. شما قبل از ثبت درخواست سرویس ، می توانید اطلاعات شرکت و شخص سرویس دهنده را مشاهده کنید." + "\n" + "همچنین در صورت وجود هرگونه نارضایتی چه در حین انجام خدمت و چه پس از آن، شما می توانید ما را مطلع کرده و ما به سرعت مشکل را برطرف خواهیم کرد."),
                (title: "آیا «کاریو» در منطقه من در دسترس است؟", description: "در حال حاضر «کاریو» سرویس های خود را در تمام نقاط تهران ارائه می دهد و همچنین در آینده ای نزدیک این خدمات را به شهر های دیگر گسترش خواهد داد."),
                (title: "نحوه ی پرداخت هزینه در «کاریو» به چه شکل است؟", description: "در بحث پرداخت سرویس های «کاریو» به دو دسته تقسیم می شوند:" + "\n" + "سرویس هایی که نیاز به تعویض قطعه ندارند: پرداخت هزینه ی این دسته از سرویس ها فقط به صورت آنلاین مقدور می باشد." + "\n" + "سرویس هایی که نیاز به تعویض قطعه دارند: در این نوع سرویس ها، شما بخشی از هزینه که مربوط به اجرت انجام خدمت می باشد را به صورت آنلاین پرداخت کرده و بخش دیگر را بایستی با توجه به قطعه و جنس انتخابی و تعویض شده در محل پرداخت کنید."),
                (title: "آیا خدمات در محل، توسط نیرو های استخدامی «کاریو» انجام می شوند؟", description: "خیر؛ «کاریو» با دقت و با توجه به استاندارد های سخت گیرانه ی خود، در هر بخش بهترین سرویس دهندگان را انتخاب کرده و شما را مستقیماً به آنها وصل می کند."),
                (title: "آیا هر زمان که بخواهم می‌توانم سفارش خود را ثبت کنم؟", description: "بله، با توجه به نوع سفارش و سرویس دهندگان آن بخش شما می توانید زمان های موجود برای دریافت آن خدمت را مشاهده کنید و در هر لحظه از شبانه روز سفارش خود را ثبت کنید."),
                (title: "آیا وقتی سرویس خودروی من انجام می شود باید در محل حضور داشته باشم؟", description: "این موضوع با توجه به نوع خدمت می تواند متفاوت باشد اما «کاریو» توصیه می کند که حتماً در محل حضور داشته باشید تا هم از کیفیت انجام خدمت مطمئن شده و هم از اطلاعات مورد نیاز در مورد آن خدمت بهره مند شوید."),
                (title: "آیا من باید لوازم کار برای سرویس را تهیه کنم؟", description: "خیر، ارائه دهندگان خدمات ما به طور کامل آماده شده اند و تهیه ی هیچ گونه تجهیزاتی بر عهده ی شما نمی باشد."),
                (title: "آیا برای ثبت سفارش حتماً باید در «کاریو» عضو باشم؟", description: ""),
                (title: "", description: "بله، در ابتدا شما بایستی اطلاعات و نوع خودروی خود را مشخص کنید"),
                (title: "چگونه می توانم سفارش های قبلی خود را مشاهده می کنم؟", description: "در نوار کناری در بخش پروفایل من شما می توانید لیست سفارش های خود را مشاهده کنید."),
                (title: "در صورت بروز هر مشکلی، چگونه می توانم سفارش خود را لغو و یا زمان آن را تغییر دهم؟", description: "شما می توانید در بخش تماس با ما در نوار کناری با ما در ارتباط بوده و ما را از این موضوع مطلع کنید."),
                (title: "آیا به صورت تلفنی نیز می توانم سفارش خود را ثبت کنم؟", description: "خیر، با هدف تسریع و بالا بردن کیفیت خدمات رسانی ثبت سفارش فقط به صورت اینترنتی انجام می پذیرد."),
                (title: "آیا بایستی به پرسنل خدمات دهنده انعام پرداخت کرد؟", description: "خیر، شما تنها مبلغ انجام سرویس را پرداخت می نمایید و هیچ گونه انعام یا پاداشی پرداخت نخواهید کرد."),
                (title: "چگونه می توانم اعتبار رایگان بدست آورم؟", description: "با معرفی «کاریو» به دوستان خود و ثبت نام آن ها با کد معرف شما هر دو طرف جمعاً 15000 تومان از «کاریو» اعتبار رایگان دریافت خواهند کرد. شما می توانید کد معرف خود را در بالای نوار کناری و با کلیک بر روی 15000تومان اعتبار رایگان مشاهده کنید."),
                (title: "چطور می توانم امتیاز کسب کنم و از آن استفاده کنم؟", description: "شما می توانید با ثبت سفارش و نظر و همچنین معرفی «کاریو» به دوستان خود امتیاز کسب کنید. لازم به ذکر است که بیشترین امتیاز با معرفی «کاریو» به دوستانتان بدست می آید. هنگامی که امتیاز شما به حد مشخصی برسد، شما مشمول برخورداری از تخفیف های ویژه می شوید."),
                (title: "چگونه با کاریو تماس بگیرم؟", description: "از صفحه ی تماس با ما دیدن فرمایید."),
            ]
        )
        
        let rateController = ContentViewController.create()
        rateController.disaster = Disaster(
            cardName: .rateUp, title: "افزایش امتیاز", description: "امتیاز بیشتر، تخفیف بیشتر", data: [
                (title: "چطور امتیازاتم را افزایش دهم؟", description: "هر سفارش 10 امتیاز" + "\n" + "هر نظر 2 امتیاز" + "\n" + "هر سرویس رایگان 1 امتیاز" + "\n" + "بالاترین امتیاز در هر هفته 20.000 تومان اعتبار دریافت خواهد نمود" + "\n" + "بالاترین امتیاز در هر ماه 100.000 تومان امتیاز دریافت خواهد نمود")
            ]
        )
        
        let rulesController = ContentViewController.create()
        rulesController.disaster = Disaster(
            cardName: .rules, title: "قوانین و محرمانگی", description: "", data: [
                (title: "ماده ۱ - تعاریف و اصطلاحات", description: "اصطلاحاتی که در این قوانین و مقررات به کار رفته است دارای معانی مشروح زیر است:\nشرکت: شرکت فناورسازان تجارت فرتاك که نسبت به ارائه خدمات کاریو اقدام می‌کند.\nکاریو: خدماتی نرم‌ افزاری که توسط شرکت به منظور سرویس‌های خدمات آنلاین ارائه می‌شود. \nاپلیکیشن: اپلیکیشن متعلق به شرکت که به منظور استفاده از خدمات کاریو، حق استفادۀ موقت از آن برابر شرایط قراردادی و سند حاضر به کاربران اعطا می‌گردد.\nکاربر: شخصی حقیقی یا حقوقی است که از طریق اینترنت به اپلیکیشن کاریو متصل و از خدمات اپلیکیشنی کاریو بهرمند می‌شود.\nحساب کاربری: حسابی است که اشخاص برای استفاده از خدمات کاریو در اپلیکیشن کاریو ایجاد کرده‌اند.\nاعتبار: مبلغی است که کاربران در حساب کاربری خود به منظور استفاده از خدمات کاریو دارند. این مبلغ به صورت پرداخت از طریق سامانۀ بانکی و کارت‌های عضو شبکۀ شتاب واریز خواهد شد.\nاطلاعات محرمانه: اطلاعاتی که توسط کاربران در اختیار کاریو قرار داده می‌شود اعم از اطلاعاتی که به صورت مستقیم از سوی کاربران وارد می‌شود و همچنین اطلاعاتی که به صورت خودکار و در نتیجۀ بهره برداری از خدمات کاریو در اختیار شرکت قرار داده می‌شود، مانند اطلاعات مربوط به موقعیت مکانی، نوع ماشین شخص.\nقوانین و مقررات جمهوری اسلامی ایران : قانون اساسی، قوانین عادی، آئین نامه های اجرایی، بخشنامه‌ها.\n"),
                (title: "ماده ۲ - حساب کاربری", description: "کاربران با ثبت نام در کاریو و همچنین با هر بار استفاده از خدمات کاریو می‌پذیرند که قوانین و مقررات جاری کاریو را به صورت کامل مطالعه کرده و با اطلاع کامل از شرایط و معانی آن را پذیرفته‌اند. این قوانین و مقررات ممکن است در طول زمان تغییرکند و بنابراین استفادۀ مستمر کاربران از اپلیکیشن به معنی پذیرش هرگونه تغییر در قوانین و مقررات آن است.\nبرای استفاده از خدمات کاریو لازم است که هر کاربر اعم از شخص حقیقی و یا حقوقی یک حساب کاربری در اپلیکیشن بسازد. برای استفاده از خدمات کاریو کاربر مذکور باید نام، نام خانوادگی، و شماره همراه خود را در اپلیکیشن کاریو ثبت کند.\nکاربران می‌پذیرند اطلاعات خواسته شده را به صورت صحیح و به‌ روز در اپلیکیشن وارد کنند و مسئول عدم صحت اطلاعات اعلام شده شخص کاربران می‌باشند. در صورت اثبات خلاف این موضوع، شرکت مجاز به پیگیری قضایی و قانونی نزد مراجع ذیصلاح می‌باشد.\nکاربران متعهد می‌گردند که صرفا با شماره موبایل متعلق به خود نسبت به ثبت نام در اپلیکیشن کاریو اقدام نمایند. در غیر این صورت در برابر شخص ذینفع صاحب شماره موبایل تماما مسئول بوده و شرکت به محض آگاهی از این موضوع نسبت به لغو عضویت کاربر مذکور اقدام خواهد نمود.\nهر شخص با توجه به مدارک هویتی تنها می‌تواند یک حساب کاربری به عنوان کاربر در اپلیکیشن داشته باشد. در صورتی که شرکت اطلاع یابد که به نام یک شخص اعم از حقیقی و یا حقوقی حساب‌های کاربری متعدد وجود دارد، شرکت مجاز خواهد بود نسبت به قطع خدمات و غیرفعال نمودن حساب‌های کاربری مذکور اقدام نماید.\nمسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری اشخاص حقیقی و یا حقوقی در اپلیکیشن یا سایر خدمات مربوط به کاریو انجام می‌شود به عهدۀ کاربران است.\nمسئولیت حفظ امنیت اطلاعات حساب کاربری به عهدۀ کاربران است. در صورت مفقود شدن یا سرقت اطلاعات حساب کاربری، کاربر مذکور موظف است در اسرع وقت موضوع را به اطلاع شرکت برساند. بدیهی است تا زمانی که اطلاع‌رسانی به شرکت انجام نشده است، مسئولیت همۀ فعالیت‌هایی که از طریق حساب کاربری مذکور انجام شده و می‌شود به عهدۀ وی خواهد بود.\nکاربران حق ندارند به اشخاص حقیقی و حقوقی دیگر اجازه استفاده از حساب کاربری خود را بدهند یا حساب خود را به شخص حقیقی یا حقوقی دیگری منتقل کنند. در مورد کاربر شخص حقوقی نیز، مسئولیت‌های قانونی بهره برداری از خدمات کاریو متوجه مدیران مجموعه‌های مذکور خواهد بود.\nدر شرایط خاصی ممکن است از کاربر برای استفاده از خدمات، درخواست احراز هویت شود، در چنین شرایطی اگر کاربر اطلاعات کافی در اختیار شرکت قرار ندهد، شرکت می‌تواند حساب کاربری وی را مسدود کرده و از ارائۀ خدمات به کاربر کاریو خودداری کند.\nممکن است بنا به مورد و حسب صلاحدید و تشخیص شرکت، از کاربران درخواست اطلاعات تکمیلی، ارائه مدارک و یا اصلاح اطلاعات موجود گردد. در این صورت کاربر مورد درخواست، متعهد به ارائه اطلاعات و یا اصلاح اطلاعات درخواستی در مدت اعلام و درخواست شده از سوی شرکت خواهد بود. در غیر این صورت شرکت می‌تواند حساب کاربری وی را مسدود کرده و از ارائۀ خدمات به کاربر مذکور خودداری کند.\n"),
                (title: "ماده ۳ - استفاده از کاریو", description: "با استفاده از خدمات کاریو کاربران می‌پذیرند و موظف می‌باشند که از کاریو برای انجام هیچ فعالیت غیر‌قانونی یا خلاف شرع یا مخالف با عرف جامعه و مخالف قوانین جمهوری اسلامی ایران استفاده نکنند.\nکاربران متعهد می‌شوند هیچ‌گاه از خدمات کاریو به صورتی که به کاریو یا شرکای آن صدمه‌ای وارد کند استفاده نکنند. در صورتی که کاربران نسبت به سوءاستفاده از امکانات فراهم شده در خدمات کاریو در جهت منافع شخصی و یا آسیب اعم از مادی و یا معنوی به منافع شرکت اقدام نمایند، شرکت ضمن داشتن حق قطع خدمات و غیرفعال نمودن حساب کاربری، مجاز خواهد بود با مراجعه به مراجع قضایی و یا سایر مراجع ذیصلاح قانونی نسبت به مطالبه جبران خسارات وارده اقدام نماید.\nکاربران می‌پذیرند که شرکت ممکن است از ارسال پیامک، ایمیل و یا Push Notification به عنوان راه ارتباطی شرکت با وی استفاده کند. کاربران می‌توانند درخواست کنند که ارسال این پیام‌ها قطع شود اما می‌پذیرند که با انصراف از دریافت این پیام‌ها، ممکن است در استفاده از خدمات با مشکل مواجه شوند و یا اطلاعات مقتضی بموقع به ایشان نرسد.\nشرکت ممکن است کدهایی به منظور هدیه به کاربر کاریو ارائه کند که با وارد کردن این کدها در نرم‌افزار، یا درصدی از هزینۀ سرویس کاسته یا درصدی از هزینۀ سرویس پس از آن به کاربر برگردانده ‌شود و یا مبلغ مشخصی به حساب کاربر در اپلیکیشن کاریو اضافه ‌شود. نحوۀ ارائه این خدمات و تعیین مهلت استفاده از آنها، منوط به تشخیص و صلاحدید شرکت بوده و در صورت عدم تعلق کدهای مذکور، کاربر کاریو حق طرح هیچگونه ادعا و اعتراضی را در این خصوص نخواهد داشت.\nکاربران می‌پذیرند که اجازۀ انتقال یا فروش کدها را به اشخاص دیگر ندارند. همچنین کاربران مجاز نیستند این کدها را به صورت عمومی منتشر کنند - حتی اگر شرکت در فضاهای عمومی به نحوی که در دسترس عموم است، این کدها را منتشر کرده باشد - مگر اینکه شرکت رسماً این اجازه را به آنها داده باشد.\nکاربر کاریو می‌پذیرد اعتباری که در حساب کاربری خود دارد مستقل از روش کسب آن (اگر در نتیجه افزایش اعتبار از طریق درگاه بانک باشد یا در نتیجه وارد کردن کدهای تخفیفی که شرکت در اختیار آنها قرار می‌دهد یا هر روش دیگری) فقط برای استفاده از خدمات کاریو قابل استفاده است و امکان دریافت این وجه را به صورت نقد ندارد.\nکاربر کاریو می‌پذیرد کدهایی که جهت افزایش اعتبار یا کاهش هزینه سرویس به وی داده می‌شود، ممکن است منقضی شوند. از آنجایی که شرکت برای ارائه این کدها هزینه ای از کاربر دریافت نمی‌کند، این حق برای شرکت محفوظ است که مبلغ یا درصد تاثیر این کدها را حتی پس از انتشار آنها تغییر دهد یا در صورت لزوم آنها را باطل کند. همچنین درصورتی که شرکت تشخیص دهد که استفاده از این کد به دلیل خطای فنی یا تخلف صورت گرفته و یا غیر قانونی بوده است می‌تواند این کدها یا اعتباری که در نتیجۀ استفاده از آنها به حساب کاربر اضافه شده است را باطل یا حذف کند.\nمسئولیت تامین اینترنت و سخت‌افزار لازم و همچنین پرداخت هزینه‌های مربوط به آنها برای استفاده از خدمات کاریو به عهدۀ کاربران است.\nکاربران متعهد می‌شوند پس از اتمام سرویس از هیچ بخش از اطلاعاتی که در نتیجۀ استفاده از خدمات کاریو، کسب کرده‌اند ، استفاده‌ای نکنند.\nبا استفاده از خدمات کاریو کاربران می‌پذیرند که در حین انجام سرویس، کاریو را وسیله‌ای برای تبلیغات و بازاریابی کالا و خدمات شخصی خود قرار ندهند و از هرگونه معرفی و عرضۀ محصولات و خدمات شخصی و یا متعلق به دیگران خودداری کنند.\nکاربران متعهد به رعایت همۀ قوانین اسلامی، شرعی، اخلاقی و اجتماعی جمهوری اسلامی ایران در هنگام استفاده ازخدمات کاریو هستند.\nکاربران می‌پذیرند که کاریو تنها خدمات نرم‌افزاری است که ارتباط بین سرویس گران و کاربران را جهت توافق بر انجام یک خدمت وسرویس فراهم می‌کنند. در خدمات کاریو سرویس گر مختار است یک درخواست خدمت را بپذیرد یا رد کند، همچنین کاربر مختار است پس از ارسال درخواست ، مشخص شدن سرویس گر و قبل از آغاز عزیمت به نقطۀ مبدا، خدمت را انجام دهد یا خیر. لذا هر سرویس و خدمتی که کاریو انجام می‌دهد باید به عنوان یک قرارداد لازم مستقل و رابطۀ قراردادی بین سرویس گر و کاربر در نظر گرفته شود.\n"),
                (title: "ماده ۴ - هزینه‌ها و پرداخت", description: "کاربر کاریو می‌پذیرد امکان استرداد هزینه‌هایی که وی به شرکت می‌پردازد وجود ندارد.\nکاربر کاریو می‌پذیرد هزینۀ خدمت از طرف شرکت مشخص می‌شود و پس از استفاده از آن اعتراضی نسبت به هزینه نمی‌تواند داشته باشد. بدیهی است از آنجایی که کاربر کاریو مجاز به عدم پذیرش هزینۀ اعلام شده از سوی شرکت می‌باشد، در صورت قبول، متعهد به پرداخت آن می‌باشد و به همین منظور کاربر مذکور با قبول این شرایط و مقررات به شرکت اختیار دریافت و وصول مبالغ مورد مطالبۀ شرکت را از محل اعتبار کاربری خود، اعطا می‌نماید.\nپرداخت هزینۀ سرویس فقط از طریق روش‌هایی که توسط کاریو مشخص می‌شود، می‌تواند صورت گیرد. این روش‌ها عبارتند از: پرداخت از طریق اعتبار موجود در حساب کاربری کاریو، پرداخت اینترنتی و یا از طریق USSD برای افزایش اعتبار و پرداخت نقدی.\nکاربران می‌پذیرند هزینۀ سرویس اعلام شده از سوی شرکت، ممکن است بسته به خدمت ارائه شده متغیر باشد. در هر صورت رقم اعلام شده از سوی شرکت بر اساس استانداردهای موجود و صلاحدید شرکت تعیین گردیده است و در صورت پذیرش از سوی کاربران، ایشان حق طرح هیچگونه ادعا و اعتراضی دراین خصوص نخواهند داشت.\nکاربر کاریو می‌پذیرد که باید هزینۀ خدمت را مستقل از هر گونه مشکلی که ممکن است در برنامۀ جهت پرداخت آنلاین به وجود آید به شرکت پرداخت کند. در صورتی که به دلیل مشکلی در برنامۀ کاریو یا مشکلات ارتباطی از جمله اینترنت و شبکۀ تلفن همراه امکان پرداخت از طریق نرم‌افزار فراهم نشود، کاربر همچنان موظف به پرداخت هزینۀ خدمت خواهد بود. در این شرایط پرداخت هزینه ممکن است با هماهنگی کاربر با مرکز تماس شرکت کاریو یا روش‌های دیگر صورت پذیرد. در صورتی که کاربر به هر دلیلی از جمله مشکلات نرم‌افزار پرداخت را انجام نداده باشد، شرکت حق دارد مبلغ خدمت را از اعتبار کاربر کسر کند و در صورت عدم پرداخت ، حساب کاربری مسدود خواهد شد.\nهمچنین چنان چه کاربر اقدام به فحاشی، توهین و ضرب و جرح و سایر اقدامات خلاف قانون نماید حق مراجعه سرویس دهنده به مراجع قضایی ذیصلاح محفوظ است. علاوه بر آن شرکت حق مراجعه به مراجع قضایی از جهت لطمه به شهرت و اعتبار تجاری خود را خواهد داشت.\n"),
                (title: "ماده 5 - مسئولیت کاریو", description: "شرکت با تمام امکانات خود از جمله مرکز تماس ، واحد رسیدگی به شکایات و فرآیند میانجیگری تمامی تلاش خود را جهت رضایت کاربران، رفع اختلافات ایجاد شده در زمان ارائه و استفاده از خدمات کاریو بین کاربران، و ایجاد صلح و سازش فی مابین آنها می‌کند.\nشرکت با استفاده از نظارت‌های خود و انجام نظرسنجی از کاربران در انتهای خدمت تلاش می‌کند خدمات با کیفیت مطلوب به کاربران ارائه دهد.\nشرکت تلاش خود را جهت فراهم نمودن امکان استفاده از خدمات نرم‌افزاری خود توسط دستگاه‌های کاربران محترم می‌کند اما تضمینی نسبت به اجرا شدن آن روی همۀ دستگاه‌ها یا همۀ شبکه‌های ارتباطی (اینترنت، شبکۀ تلفن‌ همراه و …) نخواهد داد.\nتمامی اطلاعات کاربران به عنوان اطلاعات محرمانه نزد شرکت محافظت شده و دسترسی به آن توسط اشخاص ثالث ممنوع بوده مگر برابر تصمیم مقام ذیصلاح قضایی. بنابراین در صورت درخواست و صدور دستور مقتضی از سوی مراجع قضایی، شرکت مکلف به ارائۀ اطلاعات کاربران به مراجع مذکور می‌باشد.\nچنانچه هر یک از کاربران کاریو در زمان استفاده از خدمات آن با مشکلی مواجه شوند برابر شرایط فوق می‌توانند شکایت خود را از طریق مرکز تماس و واحد رسیدگی به شکایات کاریو مطرح و شرکت پیگیری لازم و تلاش خود را جهت حل و فصل اختلافات بعمل خواهد آورد.\nجهت اطلاع بیشتر کاربران با نحوه و شرایط ارائۀ خدمات کاریو ، همۀ اطلاعات مورد نیاز کاربران توسط کاریو در نرم‌افزار قرار داده شده است و اشخاص می‌توانند با مراجعه به قسمت مذکور و مطالعۀ آنها کاملا با شرایط ذکر شده و خدمات کاریو آشنا شوند. همچنین همکاران ما در مرکز تماس پاسخگوی هر گونه ابهام و سوال کاربران هستند. لازم به توضیح است که ارائه اطلاعات کاربری صرفا از طریق اپلیکیشن امکان پذیر است و به منظور حفظ امنیت اطلاعات کاربران و اصل محرمانگی ، ارائه اطلاعات کاربری به خود کاربر و اشخاص ثالث به صورت تلفنی و حضوری مقدور نیست.\nمسئولیت کاریو فقط در فرضی است که کاربر کاریو از طریق اپلیکیشن کاریو درخواست خدمت ارسال کرده است و سرویس گر نیز این درخواست را پذیرفته است. لذا اگر سرویس گر و کاربر کاریو که در اپلیکیشن ثبت نام کرده‌اند خارج از اپلیکیشن با یکدیگر بر انجام خدمت توافق نمایند هیچ گونه مسئولیتی متوجه شرکت نخواهد بود."),
                (title: "ماده ۶ - مسئولیت کاربران", description: "مسئولیت همۀ اقدامات و افعال کاربران که ناشی از عدم رعایت قوانین موضوعه جمهوری اسلامی ایران از جمله قانون مجازات اسلامی و قوانین مدنی ، برعهدۀ شخص متخلف بوده و شرکت هیچ گونه مسئولیتی در قبال اعمال و افعال فوق نداشته و نخواهد داشت و شرکت می‌تواند ضمن غیر فعال کردن حساب کاربری متخلف، از طریق مراجع ذیصلاح، اقدامات قانونی را علیه نامبرده نسبت به احقاق حقوق قانونی شرکت به عمل آورد.\nهر گونه اقدامی از سوی کاربران که منجر به ورود خسارت به شهرت تجاری، نام و اعتبار شرکت شود تخلف از شرایط قراردادی و قانونی تلقی و شرکت حق غیر فعال نمودن کاربران و اقدام قانونی علیه ایشان را جهت مطالبه خسارت و احقاق حقوق قانونی خود خواهد داشت.\nسرویس کارهای کاریو متعهد می‌شود تنها از علایم و اقلام سازمانی که توسط کاریو تهیه و در اختیار او گذاشته شده است استفاده کند و مسئولیت استفاده از اقلام و علایمی که سبب ایجاد مشابهت و یا ایجاد اشتباه برای کاربران و یا سایر اشخاص اعم از حقیقی و یا حقوقی کند بر عهدۀ سرویسکار بوده و در صورت لزوم شرکت به قطع خدمات با نامبرده و پیگیری قانونی اقدام خواهد نمود و شخص متخلف مکلف به جبران خسارات وارده به شرکت خواهد بود.\nدر صورتی که در حین کار، سرویسکار نسبت به نقض تعهدات قانونی از سوی کاربر خدمت گیرنده اطلاع پیدا کند، سرویسکار متعهد به اعلام گزارش به مرکز تماس شرکت و مراجع انتظامی خواهد بود."),
                (title: "ماده ۷ - شرایط استفاده مشتریان", description: "مشتری متعهد می شود نسبت به خروج اشیاء ارزشمند خود از خودرو مبادرت ورزد در غیر این صورت شرکت مسئولیتی در قبال مفقود شدن آن ها ندارد."),
                (title: "ماده ۸ - موارد فنی", description: "کاربران حق ندارند هیچگونه تلاشی در جهت استخراج سورس کد (Source Code) نرم‌افزارهای کاریو شامل دیکامپایل(Decompile) ، مهندسی معکوس(Reverse Engineering) یا فعالیت‌های مشابه انجام دهد، مگر اینکه اجازۀ چنین کاری به صورت قانونی صادر شده باشد.\nکاربران مجاز نیستند با استفاده از روش‌های Framing یا Mirroring یا روش‌های دیگر نسخۀ دیگری از خدمات کاریو را روی سرورهای دیگر ارائه کنند. همچنین کاربر مجاز نیست در نرم‌افزار کاریو یا در روش ارائۀ خدمات تغییر یا اخلالی ایجاد کند.\nکاربران حق ندارند نرم‌افزار یا اسکریپتی با هدف ایندکس گذاری (Indexing)، مطالعه یا هر گونه فعالیت داده‌کاوی روی خدمات اجرا کنند.\nکاربران حق ندارند هیچ فعالیتی در راستای حصول دسترسی غیرقانونی و غیر متداول به هیچ بخش از سامانۀ کاریو یا سامانه‌های مرتبط با کاریو انجام دهند."),
                (title: "ماده ۹ - محتوای تولید شده توسط کاربران", description: "شرکت ممکن است در شرایطی به کاربران اجازه دهد که در وب سایت، نرم‌افزار موبایل و یا سایر بخش‌های این سامانه، عکس، متن، فایل صوتی، فایل تصویری یا فایل‌های مشابه منتشر کنند. مالکیت هر مطلب (شامل متن، عکس، فایل صوتی، فایل تصویری و …) که به این شکل در خدمات ثبت شود همچنان متعلق به کاربران خواهد بود. اما با ثبت آنها در خدمات‌ مرتبط به کاریو کاربران این حق را به کاریو می‌دهند که آنها را در هر مکان و هر زمانی به صورت دیجیتال یا چاپی برای هر نوع کاربردی منتشر کند. همچنین شرکت مجاز است حق انتشار این مطالب را به اشخاص حقیقی یا حقوقی دیگر منتقل کند."),
                (title: "ماده ۱۰ - قطع خدمات", description: "شرکت در شرایطی که به هر دلیل به این نتیجه برسد حضور یک کاربر (سرویس گر یا خدمت گیرنده) می‌تواند برای شرکت یا سایر خدمت گیرندگان یا کارواشگران خطرناک باشد یا مطلوب نباشد، طبق صلاحدید و تشخیص خود حق حذف دسترسی کاربر مذکور به خدمات کاریو را دارد. در این صورت، کاربر حق طرح هیچگونه ادعا و یا اعتراضی را نخواهد داشت."),
                (title: "ماده ۱۱ - توافق از راه دور", description: "کاربران توافق می‌کنند جهت مبادلۀ آسان اطلاعات، همۀ تغییرات و الحاقیه‌های قوانین و مقررات حاضر اعم از تغییر و اضافه کردن شروط آن، ارسال اخطاریه و ابلاغیه‌های مربوط به شرکت، از طریق سامانه کاریو بعمل آید و کاربران ضمن پذیرش اطلاع از شرط و روند اجرایی آن موافقت خود را نسبت به اعمال شرط مذکور اعلام می‌کنند.\nمسئولیت حفظ و حراست از حساب کاربران برعهدۀ کاربر مذکور بوده و وی ضمن پذیرش این مسئولیت، همۀ داده پیام‌های صادره از طریق حساب کاربری مذکور را منتسب به خود دانسته و هرگونه ادعایی نسبت به انکار، تردید و جعل داده پیام‌های ارسال شده از ناحیۀ نامبرده غیر قابل استماع و مردود است.\nکاربران می‌پذیرند هر گونه رویه، اشکال، عبارات مبین تایید و اعلام قبولی و تصدیق داده پیام‌های صادره از طرف شرکت به منزله امضا الکترونیکی و قبولی محسوب می‌شود و هر گونه ادعائی نسبت به امضا و قبولی مذکور غیر قابل استماع و مردود است.\nکاربران با عضویت در خدمات کاریو قصد و اراده خود را نسبت به پذیرش انعقاد هرگونه اقدام و عمل حقوقی از جمله عقود و معاملات از راه دور و از طریق سامانۀ رایانه‌ای و الکترونیکی اعلام می‌کنند."),
            ]
        )
        
        return [
            rulesController,
            rateController,
            questionController,
            callUsController,
            aboutController,
            pmController,
        ]
    }
    
    fileprivate lazy var viewControllers: [ContentViewController] = {
        return self.preparedViewControllers()
    }()
    
    // Configure scroll view
    fileprivate func configureScrollView() {
        scrollView.contentSize = CGSize(width: UIScreen.main.bounds.width * CGFloat(viewControllers.count),height: containerView.frame.height)
        for (index, viewController) in viewControllers.enumerated() {
            viewController.view.frame = CGRect(
                x: UIScreen.main.bounds.width * CGFloat(index),
                y: 0,
                width: scrollView.frame.width,
                height: scrollView.frame.height
            )
            addChild(viewController)
            scrollView.addSubview(viewController.view, options: .useAutoresize) // module's extension
            viewController.didMove(toParent: self)
        }
    }
    
    static func showModal() -> UINavigationController {
        let mainStoryboard = UIStoryboard(name: "Main", bundle: nil)
        return mainStoryboard.instantiateViewController(withIdentifier: CONTENT_NAVIGATION_CONTROLLER_ID) as! UINavigationController
    }

}

extension SegmentioViewController: UIScrollViewDelegate {
    
    func scrollViewDidEndDecelerating(_ scrollView: UIScrollView) {
        let currentPage = floor(scrollView.contentOffset.x / scrollView.frame.width)
        segmentioView.selectedSegmentioIndex = Int(currentPage)
    }
    
    func scrollViewDidScroll(_ scrollView: UIScrollView) {
        scrollView.contentSize = CGSize(width: scrollView.contentSize.width, height: 0)
    }
    
}
